// Завдання #1
// Напишіть функцію ageClassification, яка приймає один аргумент num — вік людини (число).
// Напишіть для неї тести. Протестуйте не тільки правильні варіанти

// Функція повинна повертати рядок з назвою вікової категорії відповідно до таких умов:
// меньше 0 - null
// від 0 до 24 - "Дитинство"
// від 25 до 44 - "Молодість"
// від 45 до 65 - "Зрілість"
// від 66 до 75 - "Старість"
// від 76 до 90 - "Довголіття"
// від 91 до 122 - "Рекорд"
// більше 122 - "Неможливо"


// Завдання #2
// Напишіть функцію getWeekDay, яка приймає один аргумент num — порядок дня тижня. 1 - Понеділок, 7 - Неділя
// І повертає назву дня українською
// Напишіть для неї тести. Протестуйте не тільки правильні варіанти

// 1 - 'Понеділок'
// 2 - 'Вівторок'
// 3 - 'Середа'
// 4 - 'Четвер'
// 5 - 'Пʼятниця'
// 6 - 'Субота'
// 7 - 'Неділя'
// Усе інше - null
