/*
 * Зробити проект з головним файлом проекту index.js, який буде запускатися зі скриптів package.json.
 * Усі інші файли та функції мають імпортуватися в головний і використовуватися з виводом результату в консоль.
 *
 * 1 Функція isProductionMode
 *
 * Задача:
 * Розробити функцію, яка визначає чи знаходиться додаток у режимі продакшна, виходячи зі значення змінної середовища `NODE_ENV`.
 * Функція повинна аналізувати стан середовища і відповідно повертати булеве значення.
 * Додатково функція має виводити в консоль змінну NODE_ENV.
 *
 *  - Функція `isProductionMode()` перевіряє значення змінної середовища `NODE_ENV`.
 *  - Повертає `true`, якщо `NODE_ENV` дорівнює 'production'.
 *  - Повертає `false`, якщо `NODE_ENV` має будь-яке інше значення або не встановлено.
 *  - Функція має знаходитися в окремому модулі config.js і імпортуватися в головний файл
 *
 * 2 Функція привітання користувача getUserGreeting
 *
 * Розробити модуль, який формує персональне привітання для користувача.
 * Ім’я користувача повинно передаватися через аргументи командного рядка.
 * Логіка формування повідомлень повинна бути винесена в окремий модуль
 *  - Функція `getUserGreeting()` перевіряє відповідний аргумент командної строки process.argv
 *  - якщо ім'я передано, вертає `Hello, ім'я`
 *  - якщо аргумент пустий, вертає `Hello, Guest`
 *
 * 3. Робота головного файлу проекту:
 *  - У файлі index.js імпортувати всі функції
 *  - Викликати кожну функцію.
 *  - Вивести результати у консоль.

 * 4. Вимоги до проєкту:
 *  - Усі модулі повинні підключатися через import/export.
 *  - Проєкт повинен використовувати ES Modules.
 *  - Проєкт має скрипти для запуску в режимі development і production, а також скріпт для запуску з якимсь іменем
 *  - Проєкт має працювати на будь якій системі (cross-env)
 *  - Не забуваємо додати .gitignore щоб не пушити node_modules в свій репозіторій
 */