

console.log('Helllllo World'.replace(/[A-Z]+/g, '1'));

const myRegex = /[A-Za-z]+/ig;
const myRegex2 = new RegExp('[A-Za-z]+', 'gi');

const ukrLetters = /[А-ЯЄІЇҐа-яєіїґ’]/g;

const text = 'In the middle of winter we are studing regexps on 2026-02-16. And we are struggling a lot. But tommorrow will be a new day 2026-02-17.'
const dateRegex = /(\d{4})-(\d{2})-(\d{2})/g;

const result = text.replace(dateRegex, '$3.$2.$1');
console.log('text', text);
console.log('result', result);

const advText = `Оголошення: Світ Квітів чекає на вас!
Шукаєте ідеальний подарунок? Наша крамниця пропонує найкращі рішення для ваших близьких!
У нас завжди в наявності **свіжа троянда** різних сортів. Якщо ви хочете вразити кохану, велика червона троянда — це класика, але ніжна біла троянда виглядає не менш розкішно. Для тих, хто створює квіткові композиції, наші троянди стануть справжньою окрасою букета. За деталями щодо гуртових закупівель звертайтеся за номером +380671234567 (відділ логістики).
Окрім королеви квітів, у нас є чарівна фіалка. Ця тендітна фіалка в горщику буде радувати око довгі місяці. Ви можете придбати **фіалки різних кольорів**: від ніжно-блакитних до насичено-пурпурових. Кожна фіалка доглянута з любов’ю. У нас є багато різних фіалок
Також у продажу є тюльпани, орхідеї та запашна лаванда. Наші тюльпани привозять щоранку, тому вони завжди свіжі.
Контакти для замовлення: трояндовий
* Основний номер: +38 (067) 123-45-67
* Служба доставки: +38 (095) 777-88-99
* Viber консультант: 050-987-65-43
* Міський номер: (044) 222 33 44
Завітайте до нас, і нехай кожна троянд та фіалка приносить вам радість!`

const boldRegexp = /\*\*([\s\S]*?)\*\*/g; // Шукаємо усі входження від ** до ** (зірочка - спецсимвол, ми її екрануємо за допомогою \ )

document.body.innerHTML = advText.replace(boldRegexp, '<strong>$1</strong>');
