import { calculatePrice } from './price.js';

// Щоб запустити один файл, потрібно запустити команду з іменем
// npm run test price.spec.js

// Щоб запустити один тест, потрібно запустити команду з пошуком по назві тесту
// npm test -- -t "враховуючи промокод на Валентина"

// Щоб тести автоматично запускалися при збереженні файлу я додав команду
// запускайте через npm run test:watch
// зупиняти так само через Ctrl + C в консолі

describe('функція calculatePrice', () => {
  it('функція вертає суму в грн', () => {
    expect(calculatePrice(100)).toBe('105.00 грн');
  })

  it('функція вертає суму в грн враховуючи промокод на Валентина', () => {
    expect(calculatePrice(100, 'VALENTINE_10')).toBe('114.50 грн');
  })

  it('функція вертає суму в грн враховуючи промокод до дня народження', () => {
    expect(calculatePrice(300, 'BIRTHDAY_20')).toBe('252.00 грн');
  })

  it('функція вертає таку ж суму в грн на неіснуючий промокод', () => {
    expect(calculatePrice(300, 'NOT_EXISTING_PROMO')).toBe('315.00 грн');
  })

  it('вертає нуль грн коли в неї передали 0', () => {
    expect(calculatePrice(0)).toBe('0 грн');
  })

  it('вертає нуль коли в неї не передали аргументи', () => {
    expect(calculatePrice()).toBe('0 грн');
  })

  it('вертає нуль коли в неї передали негативне число', () => {
    expect(calculatePrice(-300)).toBe('0 грн');
  })
})